zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ2038CA70144.svd
            <register>
               <name>MCAN_IE</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RF0NE</name>
                     <description>Receive FIFO 0 New Message Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0WE</name>
                     <description>Receive FIFO 0 Watermark Reached Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0FE</name>
                     <description>Receive FIFO 0 Full Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0LE</name>
                     <description>Receive FIFO 0 Message Lost Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1NE</name>
                     <description>Receive FIFO 1 New Message Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1WE</name>
                     <description>Receive FIFO 1 Watermark Reached Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1FE</name>
                     <description>Receive FIFO 1 Full Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1LE</name>
                     <description>Receive FIFO 1 Message Lost Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPME</name>
                     <description>High Priority Message Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCE</name>
                     <description>Transmission Completed Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCFE</name>
                     <description>Transmission Cancellation Finished Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFEE</name>
                     <description>Tx FIFO Empty Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFNE</name>
                     <description>Tx Event FIFO New Entry Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFWE</name>
                     <description>Tx Event FIFO Watermark Reached Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFFE</name>
                     <description>Tx Event FIFO Full Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFLE</name>
                     <description>Tx Event FIFO Event Lost Interrupt Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSWE</name>
                     <description>Timestamp Wraparound Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRAFE</name>
                     <description>Message RAM Access Failure Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOOE</name>
                     <description>Timeout Occurred Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRXE</name>
                     <description>Message stored to Dedicated Receive Buffer Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BECE</name>
                     <description>Bit Error Corrected Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BEUE</name>
                     <description>Bit Error Uncorrected Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ELOE</name>
                     <description>Error Logging Overflow Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPE</name>
                     <description>Error Passive Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWE</name>
                     <description>Warning Status Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOE</name>
                     <description>Bus_Off Status Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIE</name>
                     <description>Watchdog Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEAE</name>
                     <description>Protocol Error in Arbitration Phase Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEDE</name>
                     <description>Protocol Error in Data Phase Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARAE</name>
                     <description>Access to Reserved Address Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_ILS</name>
               <description>Interrupt Line Select Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RF0NL</name>
                     <description>Receive FIFO 0 New Message Interrupt Line</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0WL</name>
                     <description>Receive FIFO 0 Watermark Reached Interrupt Line</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0FL</name>
                     <description>Receive FIFO 0 Full Interrupt Line</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0LL</name>
                     <description>Receive FIFO 0 Message Lost Interrupt Line</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1NL</name>
                     <description>Receive FIFO 1 New Message Interrupt Line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1WL</name>
                     <description>Receive FIFO 1 Watermark Reached Interrupt Line</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1FL</name>
                     <description>Receive FIFO 1 Full Interrupt Line</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1LL</name>
                     <description>Receive FIFO 1 Message Lost Interrupt Line</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPML</name>
                     <description>High Priority Message Interrupt Line</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCL</name>
                     <description>Transmission Completed Interrupt Line</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCFL</name>
                     <description>Transmission Cancellation Finished Interrupt Line</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFEL</name>
                     <description>Tx FIFO Empty Interrupt Line</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFNL</name>
                     <description>Tx Event FIFO New Entry Interrupt Line</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFWL</name>
                     <description>Tx Event FIFO Watermark Reached Interrupt Line</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFFL</name>
                     <description>Tx Event FIFO Full Interrupt Line</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFLL</name>
                     <description>Tx Event FIFO Event Lost Interrupt Line</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSWL</name>
                     <description>Timestamp Wraparound Interrupt Line</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRAFL</name>
                     <description>Message RAM Access Failure Interrupt Line</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOOL</name>
                     <description>Timeout Occurred Interrupt Line</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRXL</name>
                     <description>Message stored to Dedicated Receive Buffer Interrupt Line</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BECL</name>
                     <description>Bit Error Corrected Interrupt Line</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BEUL</name>
                     <description>Bit Error Uncorrected Interrupt Line</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ELOL</name>
                     <description>Error Logging Overflow Interrupt Line</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPL</name>
                     <description>Error Passive Interrupt Line</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWL</name>
                     <description>Warning Status Interrupt Line</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOL</name>
                     <description>Bus_Off Status Interrupt Line</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIL</name>
                     <description>Watchdog Interrupt Line</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEAL</name>
                     <description>Protocol Error in Arbitration Phase Line</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEDL</name>
                     <description>Protocol Error in Data Phase Line</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARAL</name>
                     <description>Access to Reserved Address Line</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_ILE</name>
               <description>Interrupt Line Enable Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EINT0</name>
                     <description>Enable Interrupt Line 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EINT1</name>
                     <description>Enable Interrupt Line 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_GFC</name>
               <description>Global Filter Configuration Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RRFE</name>
                     <description>Reject Remote Frames Extended</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter remote frames with 29-bit extended IDs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REJECT</name>
                           <description>Reject all remote frames with 29-bit extended IDs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRFS</name>
                     <description>Reject Remote Frames Standard</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter remote frames with 11-bit standard IDs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REJECT</name>
                           <description>Reject all remote frames with 11-bit standard IDs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANFE</name>
                     <description>Accept Non-matching Frames Extended</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RX_FIFO_0</name>
                           <description>Accept in Rx FIFO 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX_FIFO_1</name>
                           <description>Accept in Rx FIFO 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANFS</name>
                     <description>Accept Non-matching Frames Standard</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RX_FIFO_0</name>
                           <description>Accept in Rx FIFO 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX_FIFO_1</name>
                           <description>Accept in Rx FIFO 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_SIDFC</name>
               <description>Standard ID Filter Configuration Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FLSSA</name>
                     <description>Filter List Standard Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>LSS</name>
                     <description>List Size Standard</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_XIDFC</name>
               <description>Extended ID Filter Configuration Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FLESA</name>
                     <description>Filter List Extended Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>LSE</name>
                     <description>List Size Extended</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCAN_XIDAM</name>
               <description>Extended ID AND Mask Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EIDM</name>
                     <description>Extended ID Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
